<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest osxfuse installer and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.seansgm-filewave.osxfuse</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>osxfuse</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.48kRAM.autopkg.pkg.osxfuse</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pkg_path%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/expand</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>file:////%RECIPE_CACHE_DIR%/expand/Distribution</string>
				<key>re_pattern</key>
				<string>&lt;pkg-ref id="com.github.osxfuse.pkg.Core" auth="root" onConclusion="none" version="(?P&lt;version&gt;.*?)"</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>com.github.autopkg.filewave.dockutil</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Comment</key>
			<string>Import the osxfuse pkg into FileWave</string>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
