<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest DbVisualizer and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.seansgm-filewave.DbVisualizer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DbVisualizer</string>
        <key>fw_destination_root</key>
        <string>/Applications/DbVisualizer.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.pkg.dbvisualizer</string>
	<key>Process</key>
	<array>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>info_path</key>
                                <string>%RECIPE_CACHE_DIR%/DbVisualizer/Applications/DbVisualizer.app</string>
                                <key>plist_keys</key>
                                <dict>
                                        <key>CFBundleIdentifier</key>
                                        <string>fw_app_bundle_id</string>
                                        <key>CFBundleShortVersionString</key>
                                        <string>fw_app_version</string>
                                </dict>
                        </dict>
                        <key>Processor</key>
                        <string>PlistReader</string>
                </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_fileset_name</key>
				<string>%NAME% - %fw_app_version%</string>
				<key>fw_import_source</key>
                                <string>%pkg_path%</string>
			</dict>
			<key>Comment</key>
			<string>Import the latest DbVisualizer pkg into FileWave</string>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
