<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Mozill Firefox msi.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.windowsfirefox</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WindowsFirefox</string>
        <key>DOWNLOAD_URL</key>
        <string>https://download-installer.cdn.mozilla.net/pub/firefox/releases/80.0.1/win32/en-US/Firefox%20Setup%2080.0.1.msi</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
